Revit 2024 API
ParameterTypeId.SteelElemAnchorOrientation Property
 "Anchor Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId SteelElemAnchorOrientation { get; }
Visual Basic
Public Shared ReadOnly Property SteelElemAnchorOrientation As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SteelElemAnchorOrientation {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace